# ConnectionType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsComponentConnection..::..ConnectionType Property
StairsComponentConnection Class See Also
---
The connection type of the connected stairs component.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public StairsComponentConnectionEndType ConnectionType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ConnectionType As StairsComponentConnectionEndType
	Get
```

Visual C++
---
```text
public:
property StairsComponentConnectionEndType ConnectionType {
	StairsComponentConnectionEndType get ();
}
```

# See Also
StairsComponentConnection Class
Autodesk.Revit.DB.Architecture Namespace